export const failAutologinMessage = 'При автоматической авторизации сервер ответил ошибкой.' +
            'Попробуйте войти самостоятельно.';
export const failLoginMessage = 'Ошибка при попытке входа. Ответ сервера:';

export const successRegisterMessage = 'Вы успешно зарегистрировались.' +
            'Осуществляется автоматический вход на сайт, после чего вы будете перенаправлены на страницу с фильмами';
export const failRegisterMessage = 'При регистрации сервер ответил ошибкой: ';

export const successUpdateUserInfo = 'Пользовательские данные успешно изменены!';
export const failUpdateUserInfo = 'Невозможно обновить пользовательские данные. Сервер ответил ошибкой: ';

export const failMoviesSearch = 'Во время запроса произошла ошибка. Возможно, проблема с соединением' +
            'или сервер недоступен. Подождите немного и попробуйте ещё раз';
