export const FAIL_AUTOLOGIN_MESSAGE = 'При автоматической авторизации сервер ответил ошибкой.' +
            'Попробуйте войти самостоятельно. Статус: ';
export const FAIL_LOGIN_MESSAGE = 'Ошибка при попытке входа. Статус:';

export const SUCCESS_REGISTER_MESSAGE = 'Вы успешно зарегистрировались.' +
            'Осуществляется автоматический вход на сайт, после чего вы будете перенаправлены на страницу с фильмами';
export const FAIL_REGISTER_MESSAGE = 'При регистрации сервер ответил ошибкой. Статус:  ';

export const SUCCESS_UPDATE_USER_INFO = 'Пользовательские данные успешно изменены!';
export const FAIL_UPDATE_USER_INFO = 'Невозможно обновить пользовательские данные. Сервер ответил ошибкой: ';

export const FAIL_MOVIES_SEARCH = 'Во время запроса произошла ошибка. Возможно, проблема с соединением' +
            'или сервер недоступен. Подождите немного и попробуйте ещё раз';

export const SERVER_ERROR = 'Сервер ответил ошибкой. Статус:';
